## 想法来源
最近见到deepseek harness平台大火，遂尝试在一台13年末出产的macbook air（i5 4250U 4GB ram）上跑起来。
### 不过还是小瞧了这个项目的压力。。。
作为一个重型开发与测试框架，此物对大模型的高强度的自动化评估、代码生成测试、复杂的上下文管理以及多 Agent 协同调度让配置已经老旧的电脑吃不消了，其前后端打包混用的Vite / Rolldown (tsdown) 等前沿但极其消耗内存的构建工具更是在构建过程中需要在内存中解析和编译庞大的 TypeScript 类型系统与模块树，而且这个项目下有多个子项目，用了Monorepo 多包架构，4GB 机器下实际可用 Node 堆内存只有 1.7GB~2GB，解析这些依赖关系时，V8 引擎直接把内存吃满了，导致了OOM。构建过程中，因为根目录下有个特殊的 vendor/CLAUDE.md，被 npm 的全局扫描误判，引发了 ENOTDIR。pnpm run 还有个build 报错，先爆出缺少 unrun（幽灵依赖），解决后又因为构建配置文件中的相对路径定位错误，导致找不到子模块 dsh-api-remotes 的 package.json。。。。
最后选择了放弃，走别的平台，但还是放不下可以其自主在宿主机上运行 git、pnpm install、项目编译、甚至自动拉取和修复代码，还有项目级别的全局感知力，能自动遍历整个代码库、跨多个文件修改代码，并根据编译报错自动回归修改这些功能。。。
最后选择了open-webui，再加上一些tools和pipes,编写Shell 执行器,利用 Python 的 subproces执行宿主机命令并返回控制台日志。还得编写文件读写器实现一个对挂载目录进行读写的工具，从而实现类似需求……
不过搞起来好麻烦（指的是在码这一段字的时候看到要搞这么多就望而却步了）

### 目前打算
